src/main/test/supply-chain/5-Smoke Tests/3-Control Tax NEW ALG/0-Finalization/2-TC01_06_same_TDS_one_TDS/0-ST_PTE_TC_04.02.02_same_TDS_one_TDS/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:con="http://controlTax.ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <con:controlTax>
     <arg0>
 <DocumentId>
            <SystemSourceId>COMPASS001</SystemSourceId>
            <TransactionId>1000708249</TransactionId>
         </DocumentId>
         <AlternateDocumentId>
            <CustomField1>CustomField1</CustomField1>
            <CustomField2/>
            <CustomField3/>
            <CustomField4/>
            <CustomField5/>
            <CustomField6/>
            <CustomField7/>
            <CustomField8/>
            <CustomField9/>
            <CustomField10>TEST</CustomField10>
         </AlternateDocumentId>
         <InvoiceLanguage>
            <LanguageCode>en</LanguageCode>
            <LanguageCountryCode>GB</LanguageCountryCode>
         </InvoiceLanguage>
         <CommunicationLanguage>
            <LanguageCode>en</LanguageCode>
            <LanguageCountryCode>GB</LanguageCountryCode>
         </CommunicationLanguage>
         <CalculationDecimalPlaces>0</CalculationDecimalPlaces>
         <PreviousInvoiceTaxCountry>CN</PreviousInvoiceTaxCountry>
         <TaxDecisionSet>
            <TaxDecisionSetId>1</TaxDecisionSetId>
            <SellerTaxIndicator>
               <TaxIndicatorAbbreviation>MAT_EXPZ</TaxIndicatorAbbreviation>
               <TaxIndicatorName>Export Zero %</TaxIndicatorName>
               <TaxIndicatorComment>Export of goods</TaxIndicatorComment>
            </SellerTaxIndicator>
            <SellerTaxCountry>CN</SellerTaxCountry>
            <SellerTaxState>NULL</SellerTaxState>
            <BuyerTaxIndicator>
               <TaxIndicatorAbbreviation>MAT_ZERO</TaxIndicatorAbbreviation>
               <TaxIndicatorName>Zero%</TaxIndicatorName>
               <TaxIndicatorComment>VAT zero-rated supply of goods</TaxIndicatorComment>
            </BuyerTaxIndicator>
            <BuyerTaxCountry>CN</BuyerTaxCountry>
            <BuyerTaxState>NULL</BuyerTaxState>
            <CombinedTaxIndicator>EXPZ</CombinedTaxIndicator>
            <CommercialIndicator>C</CommercialIndicator>
            <SellerTaxRegCountry>CN</SellerTaxRegCountry>
            <SellerTaxRegState>NULL</SellerTaxRegState>
            <BuyerTaxRegCountry>CN</BuyerTaxRegCountry>
            <BuyerTaxRegState>NULL</BuyerTaxRegState>
            <SellerTaxTotal>
               <NetAmount>10.00</NetAmount>
               <TaxAmount>1.30</TaxAmount>
               <GrossAmount>11.30</GrossAmount>
               <TaxAmountInLocalCurrency>11.40</TaxAmountInLocalCurrency>
               <TaxInvoiceSubTotal>
                  <TaxType>
                     <TaxTypeName>DV</TaxTypeName>
                     <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                     <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                  </TaxType>
                  <TaxCode>8</TaxCode>
                  <TaxRate>13.0</TaxRate>
                  <NetAmount>10.00</NetAmount>
                  <TaxAmount>1.30</TaxAmount>
                  <GrossAmount>11.30</GrossAmount>
                  <TaxAmountInLocalCurrency>11.40</TaxAmountInLocalCurrency>
               </TaxInvoiceSubTotal>
            </SellerTaxTotal>
            <BuyerTaxTotal>
               <NetAmount>10.00</NetAmount>
               <TaxAmount>0.00</TaxAmount>
               <GrossAmount>10.00</GrossAmount>
               <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
               <TaxInvoiceSubTotal>
                  <TaxType>
                     <TaxTypeName>DV</TaxTypeName>
                     <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                     <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                  </TaxType>
                  <TaxCode>N</TaxCode>
                  <TaxRate>0</TaxRate>
                  <NetAmount>10.00</NetAmount>
                  <TaxAmount>0</TaxAmount>
                  <GrossAmount>10.00</GrossAmount>
                  <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
               </TaxInvoiceSubTotal>
            </BuyerTaxTotal>
            <InvoiceCurrency>
               <CurrencyCode>EUR</CurrencyCode>
               <SellerLocalTaxCurrencyExchangeRate>8.7726</SellerLocalTaxCurrencyExchangeRate>
               <SellerLocalTaxCurrencyCode>CNY</SellerLocalTaxCurrencyCode>
               <BuyerLocalTaxCurrencyCode/>
            </InvoiceCurrency>
            <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
            <TaxInvoiceLine>
               <LineNumber>1</LineNumber>
               <ItemNo>1</ItemNo>
               <ItemType/>
               <UNSPSC>56100000</UNSPSC>
               <Classification>M</Classification>
               <SubClassification>GOODS</SubClassification>
               <CountryItemClassification/>
               <NetAmount>10.0</NetAmount>
               <SellerTax>
                  <SellerTaxCountry>
                     <TaxCalculationLineComponent>
                        <TaxAmount>1</TaxAmount>
                        <GrossAmount>11</GrossAmount>
                        <TaxAmountInLocalCurrency>9</TaxAmountInLocalCurrency>
                        <TaxCode>8</TaxCode>
                        <TaxType>
                           <TaxTypeName>DV</TaxTypeName>
                           <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                           <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                        </TaxType>
                        <TaxRate>13.0</TaxRate>
                     </TaxCalculationLineComponent>
                  </SellerTaxCountry>
               </SellerTax>
               <VariableTaxSteeringInput>
                  <ConsignorCountry/>
                  <ConsignorState/>
                  <ConsignorBusinessUnitCode/>
                  <ConsignorBusinessUnitType/>
                  <ConsigneeCountry/>
                  <ConsigneeState/>
                  <ConsigneeBusinessUnitCode/>
                  <ConsigneeBusinessUnitType/>
                  <CarrierCountry/>
                  <CarrierState/>
                  <CarrierBusinessUnitCode/>
                  <CarrierBusinessUnitType/>
                  <ShipmentStartCountry/>
                  <ShipmentEndCountry/>
                  <ShipmentStartState/>
                  <ShipmentEndState/>
                  <ServiceRenderedCountry/>
                  <ServiceRenderedState/>
                  <ResalePurpose/>
                  <IsOutBonded/>
                  <IsInBonded/>
                  <TaxPreAlgorithmOutput>
                     <IsExport/>
                     <IsImport/>
                     <IsExported/>
                     <IsImported/>
                  </TaxPreAlgorithmOutput>
                  <ShippingOfCustomsClearedGoods/>
               </VariableTaxSteeringInput>
               <BuyerTax>
                  <BuyerTaxCountry>
                     <TaxCalculationLineComponent>
                        <TaxAmount>0</TaxAmount>
                        <GrossAmount>10</GrossAmount>
                        <TaxAmountInLocalCurrency>0</TaxAmountInLocalCurrency>
                        <TaxCode>N</TaxCode>
                        <TaxType>
                           <TaxTypeName>DV</TaxTypeName>
                           <TaxTypeAbbreviation>VAT</TaxTypeAbbreviation>
                           <TaxTypeDescription>VALUE ADDED TAX</TaxTypeDescription>
                        </TaxType>
                        <TaxRate>0</TaxRate>
                     </TaxCalculationLineComponent>
                  </BuyerTaxCountry>
               </BuyerTax>
            </TaxInvoiceLine>
            <SellerTaxInformation>
               <TaxRegistration>
                  <TaxRegistrationCountry>CN</TaxRegistrationCountry>
                  <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                  <TaxRegistrationNumber>110115062847821</TaxRegistrationNumber>
               </TaxRegistration>
               <TaxRepresentative/>
            </SellerTaxInformation>
            <BuyerTaxInformation>
               <TaxRegistration>
                  <TaxRegistrationCountry>CN</TaxRegistrationCountry>
                  <TaxRegistrationNumberType>DV</TaxRegistrationNumberType>
                  <TaxRegistrationNumber>500905588037153</TaxRegistrationNumber>
               </TaxRegistration>
               <TaxRepresentative/>
            </BuyerTaxInformation>
         </TaxDecisionSet>
         <TaxDate>
            <TaxAlgorithmDate>2017-04-05</TaxAlgorithmDate>
			<TaxCalculationDate>2015-12-02</TaxCalculationDate>
         </TaxDate>
         <TaxModuleBehaviour>
            <SkipCalculation>N</SkipCalculation>
            <SkipDecision>N</SkipDecision>
         </TaxModuleBehaviour>
         <VariableTaxSteeringInput>
            <ConsignorCountry>CN</ConsignorCountry>
            <ConsignorState/>
            <ConsignorBusinessUnitCode>4962</ConsignorBusinessUnitCode>
            <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
            <ConsigneeCountry>CN</ConsigneeCountry>
            <ConsigneeState/>
            <ConsigneeBusinessUnitCode>4997</ConsigneeBusinessUnitCode>
            <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
            <CarrierCountry/>
            <CarrierState/>
            <CarrierBusinessUnitCode/>
            <CarrierBusinessUnitType/>
            <ShipmentStartCountry>CN</ShipmentStartCountry>
            <ShipmentEndCountry>CN</ShipmentEndCountry>
            <ShipmentStartState/>
            <ShipmentEndState/>
            <ServiceRenderedCountry/>
            <ServiceRenderedState/>
            <ResalePurpose>Y</ResalePurpose>
            <IsOutBonded>N</IsOutBonded>
            <IsInBonded>N</IsInBonded>
            <TaxPreAlgorithmOutput>
               <IsExport>Y</IsExport>
               <IsImport>N</IsImport>
               <IsExported>N</IsExported>
               <IsImported>N</IsImported>
            </TaxPreAlgorithmOutput>
            <ShippingOfCustomsClearedGoods>Y</ShippingOfCustomsClearedGoods>
         </VariableTaxSteeringInput>
         <BuyerParty>
            <Party>
               <BusinessUnitCode>4997</BusinessUnitCode>
               <BusinessUnitType>COM</BusinessUnitType>
               <BusinessUnitName/>
               <PartyAddress>
                  <AddressType/>
                  <City/>
                  <PostBox/>
                  <Street/>
                  <ZipCode/>
                  <CountryCode>CN</CountryCode>
                  <StateCode/>
                  <CountryOfLegalRegistration>CN</CountryOfLegalRegistration>
               </PartyAddress>
            </Party>
         </BuyerParty>
         <SellerParty>
            <Party>
               <BusinessUnitCode>4962</BusinessUnitCode>
               <BusinessUnitType>COM</BusinessUnitType>
               <BusinessUnitName/>
               <PartyAddress>
                  <AddressType/>
                  <City/>
                  <PostBox/>
                  <Street/>
                  <ZipCode/>
                  <CountryCode>CN</CountryCode>
                  <StateCode/>
                  <CountryOfLegalRegistration>CN</CountryOfLegalRegistration>
               </PartyAddress>
            </Party>
         </SellerParty>
         <TermOfDelivery>DDU</TermOfDelivery>
  </arg0>
      </con:controlTax>
   </soap:Body>
</soap:Envelope>